type: x-detection-rule
id: x-detection-rule--b4ec96cb-4f8c-4574-8a90-ea3a61971625
created: '2018-12-03T23:30:44.605Z'
modified: '2018-12-03T23:30:44.605Z'
title: Backup Catalog Deleted
status: experimental
description: Detects backup catalog deletions
references:
- https://technet.microsoft.com/en-us/library/cc742154(v=ws.11).aspx
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
author: Florian Roth (rule), Tom U. @c_APT_ure (collection)
logsource:
  product: windows
  service: application
detection:
  condition: selection
  selection:
    EventID: 524
    Source: Backup
falsepositives:
- Unknown
level: medium
tags:
- attack.defense_evasion
- attack.t1107
source: sigma
