type: x-detection-rule
id: x-detection-rule--c6cad88c-8aaf-469b-ac2c-ecb7889e74bd
created: '2018-12-03T23:30:44.599Z'
modified: '2018-12-03T23:30:44.599Z'
title: Disabling Windows Event Auditing
description: 'Detects scenarios where system auditing (ie: windows event log auditing)
  is disabled. This may be used in a scenario where an entity would want to bypass
  local logging to evade detection when windows event logging is enabled and reviewed.
  Also, it is recommended to turn off "Local Group Policy Object Processing" via
  GPO, which will make sure that Active Directory GPOs take precedence over local/edited
  computer policies via something such as "gpedit.msc". Please note, that disabling
  "Local Group Policy Object Processing" may cause an issue in scenarios of one
  off specific GPO modifications -- however it is recommended to perform these modifications
  in Active Directory anyways.

  '
references:
- https://bit.ly/WinLogsZero2Hero
author: '@neu5ron'
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Computer Management > Audit Policy
    Configuration, Group Policy : Computer Configuration\Windows Settings\Security
    Settings\Advanced Audit Policy Configuration\Audit Policies\Policy Change\Audit
    Audit Policy Change'
  service: security
detection:
  condition: selection
  selection:
    AuditPolicyChanges: removed
    EventID: 4719
falsepositives:
- Unknown
level: high
tags:
- attack.defense_evasion
- attack.t1054
source: sigma
