type: x-detection-rule
id: x-detection-rule--46fa1750-3e9f-47af-ad52-02e37a1c80a2
created: '2018-12-03T23:30:44.585Z'
modified: '2018-12-03T23:30:44.585Z'
title: Interactive Logon to Server Systems
description: Detects interactive console logons to
author: Florian Roth
logsource:
  product: windows
  service: security
detection:
  condition: selection and not filter
  filter:
    ComputerName: '%Workstations%'
    LogonProcessName: Advapi
  selection:
    ComputerName:
    - '%ServerSystems%'
    - '%DomainControllers%'
    EventID:
    - 528
    - 529
    - 4624
    - 4625
    LogonType: 2
falsepositives:
- Administrative activity via KVM or ILO board
level: medium
tags:
- attack.lateral_movement
- attack.t1078
source: sigma
