type: x-detection-rule
id: x-detection-rule--58fc6254-ff6b-48f3-861d-b912d41170fa
created: '2018-12-04T15:23:00.526Z'
modified: '2018-12-04T15:23:00.526Z'
title: WMI making a network connection
revision: '1'
revNotes:
- Initial commit
status: experimental
description: This rule is designed to alert on WMI making a network connection
author: Brandon Martin and Nick Ascoli
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 3
    Image:
    - '*\wmiapsrv.exe'
    Initiated:
    - true
falsepositives:
- unknown
level: medium
tags:
- attack.execution
enrichment: None
source: TALR
