type: x-detection-rule
id: x-detection-rule--d55d28c1-3488-4939-a8f0-ed708169a8b4
created: '2018-12-04T15:23:00.492Z'
modified: '2018-12-04T15:23:00.492Z'
title: WMIC process call create
revision: '1'
revNotes:
- Initial commit
status: experimental
description: This rule is designed to alert on WMIC attempting to start a process
author: Brandon Martin and Nick Ascoli
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine:
    - '*process call create *'
    EventID: 1
    Image:
    - '*\wmic.exe'
falsepositives:
- unknown
level: medium
tags:
- attack.execution
enrichment: None
source: TALR
