type: x-detection-rule
id: x-detection-rule--6208fde9-5867-47a1-8835-49673b202ac3
created: '2018-12-03T23:30:44.526Z'
modified: '2018-12-03T23:30:44.526Z'
title: Account Tampering - Suspicious Failed Logon Reasons
description: This method uses uncommon error codes on failed logons to determine
  suspicious activity and tampering with accounts that have been disabled or somehow
  restricted.
author: Florian Roth
logsource:
  product: windows
  service: security
detection:
  condition: selection
  selection:
    EventID:
    - 4625
    - 4776
    Status:
    - '0xC0000072'
    - '0xC000006F'
    - '0xC0000070'
    - '0xC0000413'
    - '0xC000018C'
falsepositives:
- User using a disabled account
level: high
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1078
source: sigma
