type: x-detection-rule
id: x-detection-rule--b7057a6b-76c0-4658-85ba-cbac5bc5af45
created: '2018-12-03T23:30:44.842Z'
modified: '2018-12-03T23:30:44.842Z'
title: WMI Persistence - Command Line Event Consumer
status: experimental
description: Detects WMI command line event consumers
references:
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
author: Thomas Patzke
date: 2018/03/07
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 7
    Image: C:\Windows\System32\wbem\WmiPrvSE.exe
    ImageLoaded: wbemcons.dll
falsepositives:
- Unknown (data set is too small; further testing needed)
level: high
tags:
- attack.t1084
- attack.persistence
source: sigma
