type: x-detection-rule
id: x-detection-rule--c4db2ad1-c3a7-4fc0-b75b-49631f704df8
created: '2018-12-03T23:30:44.470Z'
modified: '2018-12-03T23:30:44.470Z'
title: Antivirus Web Shell Detection
description: Detects a highly relevant Antivirus alert that reports a web shell
references:
- https://www.nextron-systems.com/2018/09/08/antivirus-event-analysis-cheat-sheet-v1-4/
author: Florian Roth
date: 2018/09/09
logsource:
  product: antivirus
detection:
  condition: selection
  selection:
    Signature:
    - PHP/Backdoor
    - JSP/Backdoor
    - ASP/Backdoor
    - Backdoor.PHP
    - Backdoor.JSP
    - Backdoor.ASP
    - '*Webshell*'
fields:
- FileName
- User
falsepositives:
- Unlikely
level: critical
tags:
- attack.persistence
- attack.t1100
source: sigma
