type: x-detection-rule
id: x-detection-rule--d81a8449-78ab-4c98-a54f-87a1cf03b94d
created: '2018-12-03T23:30:44.631Z'
modified: '2018-12-03T23:30:44.631Z'
title: Malicious Service Installations
description: Detects known malicious service installs that only appear in cases
  of lateral movement, credential dumping and other suspicious activity
author: Florian Roth
logsource:
  product: windows
  service: system
detection:
  condition: selection and 1 of malsvc_*
  selection:
    EventID: 7045
  malsvc_others:
    ServiceName:
    - pwdump*
    - gsecdump*
    - cachedump*
  malsvc_paexec:
    ServiceFileName: '*\PAExec*'
  malsvc_persistence:
    ServiceFileName: '* net user *'
  malsvc_pwdumpx:
    ServiceFileName: '*\DumpSvc.exe'
  malsvc_wannacry:
    ServiceName: mssecsvc2.0
  malsvc_wce:
    ServiceName:
    - WCESERVICE
    - WCE SERVICE
  malsvc_winexe:
    ServiceFileName: winexesvc.exe*
falsepositives:
- Penetration testing
level: critical
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1050
source: sigma
