type: x-detection-rule
id: x-detection-rule--dc3b46be-df16-47b0-b94a-93e5c1184028
created: '2018-12-03T23:30:44.574Z'
modified: '2018-12-03T23:30:44.574Z'
title: Password Change on Directory Service Restore Mode (DSRM) Account
status: stable
description: The Directory Service Restore Mode (DSRM) account is a local administrator
  account on Domain Controllers. Attackers may change the password to gain persistence.
references:
- https://adsecurity.org/?p=1714
author: Thomas Patzke
logsource:
  product: windows
  service: security
detection:
  condition: selection
  selection:
    EventID: 4794
falsepositives:
- Initial installation of a domain controller
level: high
tags:
- attack.persistence
- attack.privilege_escalation
source: sigma
