type: x-detection-rule
id: x-detection-rule--5558f363-da91-4581-8e64-c4c3761afa58
created: '2018-12-03T23:30:44.617Z'
modified: '2018-12-03T23:30:44.617Z'
title: Pass the Hash Activity
status: experimental
description: Detects the attack.technique pass the hash which is used to move laterally
  inside the network
references:
- https://github.com/iadgov/Event-Forwarding-Guidance/tree/master/Events
author: Ilias el Matani (rule), The Information Assurance Directorate at the NSA
  (method)
logsource:
  product: windows
  description: The successful use of PtH for lateral movement between workstations
    would trigger event ID 4624, a failed logon attempt would trigger an event ID
    4625
  service: security
detection:
  condition: selection and not filter
  filter:
    AccountName: ANONYMOUS LOGON
  selection:
  - ComputerName: '%Workstations%'
    EventID: 4624
    LogonProcessName: NtLmSsp
    LogonType: '3'
    WorkstationName: '%Workstations%'
  - ComputerName: '%Workstations%'
    EventID: 4625
    LogonProcessName: NtLmSsp
    LogonType: '3'
    WorkstationName: '%Workstations%'
falsepositives:
- Administrator activity
- Penetration tests
level: medium
tags:
- attack.lateral_movement
- attack.t1075
source: sigma
