type: x-detection-rule
id: x-detection-rule--a119e984-9765-444b-b62e-aaaad1c31bb7
created: '2018-12-03T23:30:44.912Z'
modified: '2018-12-03T23:30:44.912Z'
title: Suspicious Certutil Command
status: experimental
description: Detects a suspicious Microsoft certutil execution with sub commands
  like 'decode' sub command, which is sometimes used to decode malicious code with
  the built-in certutil utility
references:
- https://twitter.com/JohnLaTwC/status/835149808817991680
- https://twitter.com/subTee/status/888102593838362624
- https://twitter.com/subTee/status/888071631528235010
- https://blogs.technet.microsoft.com/pki/2006/11/30/basic-crl-checking-with-certutil/
- https://www.trustedsec.com/2017/07/new-tool-release-nps_payload/
author: Florian Roth, juju4
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine:
    - '*certutil * -decode *'
    - '*certutil * -decodehex *'
    - '*certutil *-urlcache* http*'
    - '*certutil *-urlcache* ftp*'
    - '*certutil *-URL*'
    - '*certutil *-ping*'
    - '*certutil.exe * -decode *'
    - '*certutil.exe * -decodehex *'
    - '*certutil.exe *-urlcache* http*'
    - '*certutil.exe *-urlcache* ftp*'
    - '*certutil.exe *-URL*'
    - '*certutil.exe *-ping*'
    EventID: 1
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: high
tags:
- attack.defense_evasion
- attack.t1140
- attack.s0189
- attack.g0007
source: sigma
