type: x-detection-rule
id: x-detection-rule--a48104d2-83ff-4825-a091-3a7ce404e77b
created: '2018-12-03T23:30:44.857Z'
modified: '2018-12-03T23:30:44.857Z'
title: System File Execution Location Anomaly
status: experimental
description: Detects a Windows program executable started in a suspicious folder
references:
- https://twitter.com/GelosSnake/status/934900723426439170
author: Florian Roth
date: 2017/11/27
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection and not filter
  filter:
    Image:
    - '*\System32\*'
    - '*\SysWow64\*'
  selection:
    EventID: 1
    Image:
    - '*\svchost.exe'
    - '*\rundll32.exe'
    - '*\services.exe'
    - '*\powershell.exe'
    - '*\regsvr32.exe'
    - '*\spoolsv.exe'
    - '*\lsass.exe'
    - '*\smss.exe'
    - '*\csrss.exe'
    - '*\conhost.exe'
falsepositives:
- Exotic software
level: high
tags:
- attack.defense_evasion
source: sigma
