type: x-detection-rule
id: x-detection-rule--41bf9109-c88c-4bef-8216-c9234d90e42d
created: '2018-12-03T23:30:44.458Z'
modified: '2018-12-03T23:30:44.458Z'
title: Apache Segmentation Fault
description: Detects a segmentation fault error message caused by a creashing apacke
  worker process
references:
- http://www.securityfocus.com/infocus/1633
author: Florian Roth
logsource:
  product: apache
detection:
  condition: keywords
  keywords:
  - exit signal Segmentation Fault
falsepositives:
- Unknown
level: high
source: sigma
