type: x-detection-rule
id: x-detection-rule--12235c58-522d-4ee7-a946-1e39a847ba3b
created: '2018-12-03T23:30:44.873Z'
modified: '2018-12-03T23:30:44.873Z'
title: Command Line Execution with suspicious URL and AppData Strings
status: experimental
description: Detects a suspicious command line execution that includes an URL and
  AppData string in the command line parameters as used by several droppers (js/vbs
  > powershell)
references:
- https://www.hybrid-analysis.com/sample/3a1f01206684410dbe8f1900bbeaaa543adfcd07368ba646b499fa5274b9edf6?environmentId=100
- https://www.hybrid-analysis.com/sample/f16c729aad5c74f19784a24257236a8bbe27f7cdc4a89806031ec7f1bebbd475?environmentId=100
author: Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine:
    - cmd.exe /c *http://*%AppData%
    - cmd.exe /c *https://*%AppData%
    EventID: 1
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- High
level: medium
source: sigma
