type: x-detection-rule
id: x-detection-rule--41b2880d-af3b-40d8-8b95-99112e97648c
created: '2018-12-03T23:30:44.326Z'
modified: '2018-12-03T23:30:44.326Z'
title: Detects Suspicious Commands on Linux systems
status: experimental
description: Detects relevant commands often related to malware or hacking activity
references:
- Internal Research - mostly derived from exploit code including code in MSF
author: Florian Roth
date: 2017/12/12
logsource:
  product: linux
  service: auditd
detection:
  cmds:
  - a0: chmod
    a1: '777'
    type: EXECVE
  - a0: chmod
    a1: u+s
    type: EXECVE
  - a0: cp
    a1: /bin/ksh
    type: EXECVE
  - a0: cp
    a1: /bin/sh
    type: EXECVE
  condition: 1 of cmds
falsepositives:
- Admin activity
level: medium
source: sigma
