type: x-detection-rule
id: x-detection-rule--36e0a77d-cb18-45f8-8fb0-36c0f8526bac
created: '2018-12-03T23:30:44.650Z'
modified: '2018-12-03T23:30:44.650Z'
title: DHCP Server Error Failed Loading the CallOut DLL
status: experimental
description: This rule detects a DHCP server error in which a specified Callout
  DLL (in registry) could not be loaded
references:
- https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
- https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
- https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
author: Dimitrios Slamaris
date: 2017/05/15
logsource:
  product: windows
  service: system
detection:
  condition: selection
  selection:
    EventID:
    - 1031
    - 1032
    - 1034
falsepositives:
- Unknown
level: critical
source: sigma
