type: x-detection-rule
id: x-detection-rule--73ebb8e6-da0c-4f4c-9c61-345db2ba6c77
created: '2018-12-03T23:30:44.654Z'
modified: '2018-12-03T23:30:44.654Z'
title: DNS Server Error Failed Loading the ServerLevelPluginDLL
status: experimental
description: This rule detects a DNS server error in which a specified plugin DLL
  (in registry) could not be loaded
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://technet.microsoft.com/en-us/library/cc735829(v=ws.10).aspx
- https://twitter.com/gentilkiwi/status/861641945944391680
author: Florian Roth
date: 2017/05/08
logsource:
  product: windows
  service: dns-server
detection:
  condition: selection
  selection:
    EventID:
    - 150
    - 770
falsepositives:
- Unknown
level: critical
source: sigma
