type: x-detection-rule
id: x-detection-rule--7083d757-dbba-4bb4-a450-cc032d6e455a
created: '2018-12-03T23:30:44.436Z'
modified: '2018-12-03T23:30:44.436Z'
title: Download EXE from Suspicious TLD
status: experimental
description: Detects executable downloads from suspicious remote systems
author: Florian Roth
logsource:
  category: proxy
detection:
  condition: selection and not filter
  filter:
    r-dns:
    - '*.com'
    - '*.org'
    - '*.net'
    - '*.edu'
    - '*.gov'
    - '*.uk'
    - '*.ca'
    - '*.de'
    - '*.jp'
    - '*.fr'
    - '*.au'
    - '*.us'
    - '*.ch'
    - '*.it'
    - '*.nl'
    - '*.se'
    - '*.no'
    - '*.es'
  selection:
    c-uri-extension:
    - exe
    - vbs
    - bat
    - rar
    - ps1
    - doc
    - docm
    - xls
    - xlsm
    - pptm
    - rtf
    - hta
    - dll
    - ws
    - wsf
    - sct
    - zip
fields:
- ClientIP
- URL
falsepositives:
- All kind of software downloads
level: low
source: sigma
