type: x-detection-rule
id: x-detection-rule--ffd92fc2-6cd0-441d-a6b8-4044caf65762
created: '2018-12-03T23:30:44.382Z'
modified: '2018-12-03T23:30:44.382Z'
title: Fireball Archer Install
status: experimental
description: Detects Archer malware invocation via rundll32
references:
- https://www.virustotal.com/en/file/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022/analysis/
- https://www.hybrid-analysis.com/sample/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022?environmentId=100
author: Florian Roth
date: 2017/06/03
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine: '*\rundll32.exe *,InstallArcherSvc'
    EventID: 1
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unknown
level: high
source: sigma
