type: x-detection-rule
id: x-detection-rule--6d237007-77f0-40dd-a739-7f790456dc92
created: '2018-12-03T23:30:44.919Z'
modified: '2018-12-03T23:30:44.919Z'
title: Microsoft Outlook Spawning Windows Shell
status: experimental
description: Detects a Windows command line executable started from Microsoft Outlook
references:
- https://www2.cybereason.com/asset/60:research-cobalt-kitty-attack-lifecycle
author: Florian Roth
date: 2018/03/06
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 1
    Image:
    - '*\cmd.exe'
    - '*\powershell.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\schtasks.exe'
    ParentImage:
    - '*\OUTLOOK.EXE'
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- False positives are possible, depends on organisation and processes
level: high
source: sigma
