type: x-detection-rule
id: x-detection-rule--9b75d860-60ef-47d6-808c-c13bc3cdb6f8
created: '2018-12-03T23:30:44.460Z'
modified: '2018-12-03T23:30:44.460Z'
title: Multiple suspicious Response Codes caused by Single Client
description: Detects possible exploitation activity or bugs in a web application
author: Thomas Patzke
logsource:
  category: webserver
detection:
  condition: selection | count() by clientip > 10
  selection:
    response:
    - 400
    - 401
    - 403
    - 500
  timeframe: 10m
fields:
- client_ip
- vhost
- url
- response
falsepositives:
- Unstable application
- Application that misuses the response codes
level: medium
source: sigma
