type: x-detection-rule
id: x-detection-rule--8e2afc8d-7f01-480b-9e17-1e98aa614f70
created: '2018-12-03T23:30:44.323Z'
modified: '2018-12-03T23:30:44.323Z'
title: Multiple Modsecurity Blocks
description: Detects multiple blocks by the mod_security module (Web Application
  Firewall)
logsource:
  product: linux
  service: modsecurity
detection:
  condition: selection | count() > 6
  selection:
  - 'mod_security: Access denied'
  - 'ModSecurity: Access denied'
  - 'mod_security-message: Access denied'
  timeframe: 120m
falsepositives:
- Vulnerability scanners
- Frequent attacks if system faces Internet
level: medium
source: sigma
