type: x-detection-rule
id: x-detection-rule--c91beae4-52a5-4c1f-80c2-21a2fbd394b3
created: '2018-12-03T23:30:44.716Z'
modified: '2018-12-03T23:30:44.716Z'
title: Office Macro Starts Cmd
status: experimental
description: Detects a Windows command line executable started from Microsoft Word
  or Excel
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
author: Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 1
    Image: '*\cmd.exe'
    ParentImage:
    - '*\WINWORD.EXE'
    - '*\EXCEL.EXE'
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- unknown
level: high
source: sigma
