type: x-detection-rule
id: x-detection-rule--24622874-1654-4919-89d9-dadf1a5a4ee4
created: '2018-12-03T23:30:44.534Z'
modified: '2018-12-03T23:30:44.534Z'
action: global
title: Reconnaissance Activity with Net Command
status: experimental
description: Detects a set of commands often used in recon stages by different attack
  groups
references:
- https://twitter.com/haroonmeer/status/939099379834658817
- https://twitter.com/c_APT_ure/status/939475433711722497
- https://www.fireeye.com/blog/threat-research/2016/05/targeted_attacksaga.html
author: Florian Roth, Markus Neis
date: 2018/08/22
detection:
  condition: selection | count() > 4
  selection:
    CommandLine:
    - tasklist
    - net time
    - systeminfo
    - whoami
    - nbtstat
    - net start
    - '*\net1 start'
    - qprocess
    - nslookup
    - hostname.exe
    - '*\net1 user /domain'
    - '*\net1 group /domain'
    - '*\net1 group "domain admins" /domain'
    - '*\net1 group "Exchange Trusted Subsystem" /domain'
    - '*\net1 accounts /domain'
    - '*\net1 user net localgroup administrators'
    - netstat -an
  timeframe: 15s
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: medium
tags:
- attack.discovery
- attack.t1073
- attack.t1012
type: x-detection-rule
id: x-detection-rule--2fec9669-1c76-4806-ba7c-6b300fa92c7a
created: '2018-12-03T23:30:44.535Z'
modified: '2018-12-03T23:30:44.535Z'
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
type: x-detection-rule
id: x-detection-rule--60ee5e24-7be3-427a-b8a9-2a7ebd5e2fbf
created: '2018-12-03T23:30:44.535Z'
modified: '2018-12-03T23:30:44.535Z'
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation,
    Group Policy : Administrative Templates\System\Audit Process Creation'
  service: security
detection:
  selection:
    EventID: 4688
source: sigma
