type: x-detection-rule
id: x-detection-rule--1abc3312-c6dc-4522-9c97-58a8a985f64d
created: '2018-12-03T23:30:44.453Z'
modified: '2018-12-03T23:30:44.453Z'
title: Ruby on Rails framework exceptions
description: Detects suspicious Ruby on Rails exceptions that could indicate exploitation
  attempts
references:
- http://edgeguides.rubyonrails.org/security.html
- http://guides.rubyonrails.org/action_controller_overview.html
- https://stackoverflow.com/questions/25892194/does-rails-come-with-a-not-authorized-exception
- https://github.com/rails/rails/blob/master/actionpack/lib/action_dispatch/middleware/exception_wrapper.rb
author: Thomas Patzke
logsource:
  category: application
  product: ruby_on_rails
detection:
  condition: keywords
  keywords:
  - ActionController::InvalidAuthenticityToken
  - ActionController::InvalidCrossOriginRequest
  - ActionController::MethodNotAllowed
  - ActionController::BadRequest
  - ActionController::ParameterMissing
falsepositives:
- Application bugs
- Penetration testing
level: medium
source: sigma
