type: x-detection-rule
id: x-detection-rule--b8483575-67ab-4b0f-80ce-3e508b83e661
created: '2018-12-03T23:30:44.884Z'
modified: '2018-12-03T23:30:44.884Z'
title: Suspicious Program Location with Network Connections
status: experimental
description: Detects programs with network connections running in suspicious files
  system locations
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
author: Florian Roth
date: 2017/03/19
logsource:
  product: windows
  description: Use the following config to generate the necessary Event ID 3 Network
    Connection events
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 3
    Image:
    - '*\ProgramData\*'
    - '*\$Recycle.bin'
    - '*\Users\All Users\*'
    - '*\Users\Default\*'
    - '*\Users\Public\*'
    - C:\Perflogs\*
    - '*\config\systemprofile\*'
    - '*\Windows\Fonts\*'
    - '*\Windows\IME\*'
    - '*\Windows\addins\*'
falsepositives:
- unknown
level: high
source: sigma
