type: x-detection-rule
id: x-detection-rule--caf6014e-3603-4055-8ae8-0367689369c0
created: '2018-12-03T23:30:44.322Z'
modified: '2018-12-03T23:30:44.322Z'
title: Suspicious Log Entries
description: Detects suspicious log entries in Linux log files
author: Florian Roth
logsource:
  product: linux
detection:
  condition: keywords
  keywords:
  - entered promiscuous mode
  - Deactivating service
  - Oversized packet received from
  - imuxsock begins to drop messages
falsepositives:
- Unknown
level: medium
source: sigma
