type: x-detection-rule
id: x-detection-rule--bb112f0c-2d22-487a-8642-38903669867e
created: '2018-12-03T23:30:44.390Z'
modified: '2018-12-03T23:30:44.390Z'
title: Telegram Bot API Request
status: experimental
description: Detects suspicious DNS queries to api.telegram.org used by Telegram
  Bots of any kind
references:
- https://core.telegram.org/bots/faq
- https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
- https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
- https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
author: Florian Roth
date: 2018/06/05
logsource:
  category: dns
detection:
  condition: selection
  selection:
    query:
    - api.telegram.org
falsepositives:
- Legitimate use of Telegram bots in the company
level: medium
source: sigma
