type: x-detection-rule
id: x-detection-rule--1e0a7d4b-3ffc-4cce-a872-bb060356d452
created: '2018-12-03T23:30:44.348Z'
modified: '2018-12-03T23:30:44.348Z'
title: Turla Group Named Pipes
status: experimental
description: Detects a named pipe used by Turla group samples
references:
- Internal Research
author: Markus Neis
date: 2017/11/06
logsource:
  product: windows
  description: Note that you have to configure logging for PipeEvents in Symson
    config
  service: sysmon
detection:
  condition: selection
  selection:
    EventID:
    - 17
    - 18
    PipeName:
    - \atctl
    - \userpipe
    - \iehelper
    - \sdlrpc
    - \comnap
falsepositives:
- Unkown
level: critical
tags:
- attack.g0010
source: sigma
