type: x-detection-rule
id: x-detection-rule--748e9974-c3c4-4891-be6f-cca3e1705e07
created: '2018-12-03T23:30:44.393Z'
modified: '2018-12-03T23:30:44.393Z'
title: DNS TXT Answer with possible execution strings
status: experimental
description: Detects strings used in command execution in DNS TXT Answer
references:
- https://twitter.com/stvemillertime/status/1024707932447854592
- https://github.com/samratashok/nishang/blob/master/Backdoors/DNS_TXT_Pwnage.ps1
author: Markus Neis
date: 2018/08/08
logsource:
  category: dns
detection:
  condition: selection
  selection:
    answer:
    - '*IEX*'
    - '*Invoke-Expression*'
    - '*cmd.exe*'
falsepositives:
- Unknown
level: high
tags:
- attack.t1071
source: sigma
