type: x-detection-rule
id: x-detection-rule--520bc7d1-e0d7-4aa9-8cee-ec4f3e56543a
created: '2018-12-03T23:30:44.360Z'
modified: '2018-12-03T23:30:44.360Z'
title: Turla PNG Dropper Service
description: This method detects malicious services mentioned in Turla PNG dropper
  report by NCC Group in November 2018
references:
- https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/november/turla-png-dropper-is-back/
author: Florian Roth
date: 2018/11/23
logsource:
  product: windows
  service: system
detection:
  condition: selection
  selection:
    EventID: 7045
    ServiceName: WerFaultSvc
falsepositives:
- unlikely
level: critical
tags:
- attack.command_and_control
- attack.g0016
- attack.t1172
source: sigma
