type: x-detection-rule
id: x-detection-rule--b5e15ec9-1b35-46ef-a9f4-76c2e70739ec
created: '2018-12-03T23:30:44.543Z'
modified: '2018-12-03T23:30:44.543Z'
title: Malicious Service Install
description: This method detects well-known keywords of malicious services in the
  Windows System Eventlog
author: Florian Roth
logsource:
  product: windows
  service: system
detection:
  condition: ( selection and keywords ) or quarkspwdump
  keywords:
  - WCE SERVICE
  - WCESERVICE
  - DumpSvc
  quarkspwdump:
    EventID: 16
    HiveName: '*\AppData\Local\Temp\SAM*.dmp'
  selection:
    EventID:
    - 7045
    - 4697
falsepositives:
- Unlikely
level: high
tags:
- attack.credential_access
- attack.t1003
- attack.s0005
source: sigma
