type: x-detection-rule
id: x-detection-rule--92134e1d-496d-4c86-a53e-158fd0977bc9
created: '2018-12-03T23:30:44.890Z'
modified: '2018-12-03T23:30:44.890Z'
title: Mimikatz Detection LSASS Access
status: experimental
description: Detects process access to LSASS which is typical for Mimikatz (0x1000
  PROCESS_QUERY_ LIMITED_INFORMATION, 0x0400 PROCESS_QUERY_ INFORMATION, 0x0010
  PROCESS_VM_READ)
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 10
    GrantedAccess: '0x1410'
    TargetImage: C:\windows\system32\lsass.exe
falsepositives:
- unknown
level: high
tags:
- attack.t1003
- attack.s0002
- attack.lateral_movement
- attack.credential_access
source: sigma
