type: x-detection-rule
id: x-detection-rule--f65708d2-ea4c-4c87-902a-55c864eb79e1
created: '2018-12-03T23:30:44.556Z'
modified: '2018-12-03T23:30:44.556Z'
title: Password Dumper Activity on LSASS
status: experimental
description: Detects process handle on LSASS process with certain access mask and
  object type SAM_DOMAIN
references:
- https://twitter.com/jackcr/status/807385668833968128
logsource:
  product: windows
  service: security
detection:
  condition: selection
  selection:
    AccessMask: '0x705'
    EventID: 4656
    ObjectType: SAM_DOMAIN
    ProcessName: C:\Windows\System32\lsass.exe
falsepositives:
- Unkown
level: high
tags:
- attack.credential_access
- attack.t1003
source: sigma
