type: x-detection-rule
id: x-detection-rule--42b5fb7a-6ab0-4bc2-93d1-76f978f77d69
created: '2018-12-03T23:30:44.875Z'
modified: '2018-12-03T23:30:44.875Z'
title: Password Dumper Remote Thread in LSASS
status: stable
description: Detects password dumper activity by monitoring remote thread creation
  EventID 8 in combination with the lsass.exe process as TargetImage. The process
  in field Process is the malicious program. A single execution can lead to hundreds
  of events.
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
author: Thomas Patzke
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 8
    StartModule: null
    TargetImage: C:\Windows\System32\lsass.exe
falsepositives:
- unknown
level: high
tags:
- attack.credential_access
- attack.t1003
- attack.s0005
source: sigma
