type: x-detection-rule
id: x-detection-rule--c66cf6d2-efea-4d3b-bc4a-c6513fb3f8fc
created: '2018-12-03T23:30:44.641Z'
modified: '2018-12-03T23:30:44.641Z'
title: Possible Remote Password Change Through SAMR
description: Detects a possible remote NTLM hash change through SAMR API SamiChangePasswordUser()
  or SamSetInformationUser(). "Audit User Account Management" in "Advanced Audit
  Policy Configuration" has to be enabled in your local security policy / GPO to
  see this events.
author: Dimitrios Slamaris
logsource:
  product: windows
  service: security
detection:
  condition: ( passwordchanged and not passwordchanged_filter ) | near samrpipe
  passwordchanged:
    EventID: 4738
  passwordchanged_filter:
    PasswordLastSet: null
  timeframe: 15s
  samrpipe:
    EventID: 5145
    RelativeTargetName: samr
level: medium
tags:
- attack.credential_access
- attack.t1212
source: sigma
