type: x-detection-rule
id: x-detection-rule--aeece2cc-4b1c-49fe-9bf0-aab05743b860
created: '2018-12-03T23:30:44.766Z'
modified: '2018-12-03T23:30:44.766Z'
title: Powershell AMSI Bypass via .NET Reflection
status: experimental
description: Detects Request to amsiInitFailed that can be used to disable AMSI
  Scanning
references:
- https://twitter.com/mattifestation/status/735261176745988096
- https://www.hybrid-analysis.com/sample/0ced17419e01663a0cd836c9c2eb925e3031ffb5b18ccf35f4dea5d586d0203e?environmentId=120
author: Markus Neis
date: 2018/08/17
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection1 and selection2
  falsepositives:
  - Potential Admin Activity
  selection1:
    CommandLine:
    - '*System.Management.Automation.AmsiUtils*'
    EventID: 1
  selection2:
    CommandLine:
    - '*amsiInitFailed*'
level: high
tags:
- attack.execution
- attack.t1086
source: sigma
