type: x-detection-rule
id: x-detection-rule--6cf44b17-f61a-4aee-9af1-8c2d37060ef6
created: '2018-12-03T23:30:44.706Z'
modified: '2018-12-03T23:30:44.706Z'
title: PowerShell Credential Prompt
status: experimental
description: Detects PowerShell calling a credential prompt
references:
- https://twitter.com/JohnLaTwC/status/850381440629981184
- https://t.co/ezOTGy1a1G
author: John Lambert (idea), Florian Roth (rule)
logsource:
  product: windows
  description: Script block logging must be enabled
  service: powershell
detection:
  condition: all of them
  keyword:
  - PromptForCredential
  selection:
    EventID: 4104
falsepositives:
- Unknown
level: high
tags:
- attack.execution
- attack.credential_access
- attack.t1086
source: sigma
