type: x-detection-rule
id: x-detection-rule--934c56d7-c2bf-4024-b6b3-70872f69f2ed
created: '2018-12-03T23:30:44.719Z'
modified: '2018-12-03T23:30:44.719Z'
title: PowerShell Network Connections
status: experimental
description: Detects a Powershell process that opens network connections - check
  for suspicious target ports and target systems - adjust to your environment (e.g.
  extend filters with company's ip range')
references:
- https://www.youtube.com/watch?v=DLtJTxMWZ2o
author: Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection and not filter
  filter:
    DestinationIp:
    - 10.*
    - 192.168.*
    - 172.*
    - 127.0.0.1
    DestinationIsIpv6: 'false'
    User: NT AUTHORITY\SYSTEM
  selection:
    EventID: 3
    Image: '*\powershell.exe'
falsepositives:
- Administrative scripts
level: low
tags:
- attack.execution
- attack.t1086
source: sigma
