type: x-detection-rule
id: x-detection-rule--6045a14f-da6c-4734-9c45-7349703a18e3
created: '2018-12-03T23:30:44.614Z'
modified: '2018-12-03T23:30:44.614Z'
title: PsExec Service Start
description: Detects a PsExec service start
author: Florian Roth
date: 2018/03/13
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation,
    Group Policy : Administrative Templates\System\Audit Process Creation'
  service: security
detection:
  condition: 1 of them
  selection:
    EventID: 4688
    CommandLine: C:\Windows\PSEXESVC.exe
falsepositives:
- Administrative activity
level: low
tags:
- attack.execution
- attack.t1035
- attack.s0029
source: sigma
