type: x-detection-rule
id: x-detection-rule--8ee2ec61-88f3-41f7-aea7-749a58ae9355
created: '2018-12-03T23:30:44.801Z'
modified: '2018-12-03T23:30:44.801Z'
title: Suspicious WMI execution
status: experimental
description: Detects WMI executing suspicious commands
references:
- https://digital-forensics.sans.org/blog/2010/06/04/wmic-draft/
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
- https://blog.malwarebytes.com/threat-analysis/2016/04/rokku-ransomware/
author: Michael Haag, Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine:
    - '*/NODE:*process call create *'
    - '* path AntiVirusProduct get *'
    - '* path FirewallProduct get *'
    - '* shadowcopy delete *'
    EventID: 1
    Image:
    - '*\wmic.exe'
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Will need to be tuned
- If using Splunk, I recommend | stats count by Computer,CommandLine following for
  easy hunting by Computer/CommandLine.
level: medium
tags:
- attack.execution
- attack.t1047
source: sigma
