type: x-detection-rule
id: x-detection-rule--949c29c6-b517-42d0-bf9a-ec60f66ca20c
created: '2018-12-03T23:30:44.331Z'
modified: '2018-12-03T23:30:44.331Z'
title: WMIExec VBS Script
description: Detects suspicious file execution by wscript and cscript
references:
- https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
author: Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine: '*.vbs /shell *'
    EventID: 1
    Image: '*\cscript.exe'
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Unlikely
level: critical
tags:
- attack.execution
- attack.g0045
- attack.t1064
source: sigma
