type: x-detection-rule
id: x-detection-rule--4c30bc24-dbb9-47a8-b0da-9bcde27692f7
created: '2018-12-03T23:30:44.472Z'
modified: '2018-12-03T23:30:44.472Z'
title: Antivirus Password Dumper Detection
description: Detects a highly relevant Antivirus alert that reports a password dumper
references:
- https://www.nextron-systems.com/2018/09/08/antivirus-event-analysis-cheat-sheet-v1-4/
author: Florian Roth
date: 2018/09/09
logsource:
  product: antivirus
detection:
  condition: selection
  selection:
    Signature:
    - '*DumpCreds*'
    - '*Mimikatz*'
    - '*PWCrack*'
    - HTool/WCE
    - '*PSWtool*'
    - '*PWDump*'
fields:
- FileName
- User
falsepositives:
- Unlikely
level: critical
tags:
- attack.credential_access
- attack.t1003
source: sigma
