type: x-detection-rule
id: x-detection-rule--af530cb5-092c-4d46-b307-82502df5ca4d
created: '2018-12-03T23:30:44.621Z'
modified: '2018-12-03T23:30:44.621Z'
title: Mimikatz DC Sync
status: experimental
description: Detects Mimikatz DC sync security events
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
author: Benjamin Delpy, Florian Roth
date: 2018/06/03
logsource:
  product: windows
  service: security
detection:
  condition: selection
  selection:
    EventID: 4662
    Properties:
    - '*Replicating Directory Changes All*'
    - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
falsepositives:
- Unkown
level: critical
tags:
- attack.credential_access
- attack.s0002
- attack.t1003
source: sigma
