type: x-detection-rule
id: x-detection-rule--49168bf3-e051-41df-8752-728a83f8c796
created: '2018-12-03T23:30:44.601Z'
modified: '2018-12-03T23:30:44.601Z'
action: global
title: NetNTLM Downgrade Attack
description: Detects post exploitation using NetNTLM downgrade attacks
reference:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
author: Florian Roth
date: 2018/03/20
detection:
  condition: 1 of them
falsepositives:
- Unknown
level: critical
tags:
- attack.credential_access
- attack.t1212
type: x-detection-rule
id: x-detection-rule--a0b163b7-4add-4e9d-93d0-b27e3e52d497
created: '2018-12-03T23:30:44.602Z'
modified: '2018-12-03T23:30:44.602Z'
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    EventID: 13
    TargetObject:
    - '*SYSTEM\*ControlSet*\Control\Lsa\lmcompatibilitylevel'
    - '*SYSTEM\*ControlSet*\Control\Lsa\NtlmMinClientSec'
    - '*SYSTEM\*ControlSet*\Control\Lsa\RestrictSendingNTLMTraffic'
type: x-detection-rule
id: x-detection-rule--5935f1e8-c2ab-4d22-bae2-fcded8f83e34
created: '2018-12-03T23:30:44.603Z'
modified: '2018-12-03T23:30:44.603Z'
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
  service: security
detection:
  selection2:
    EventID: 4657
    ObjectName: \REGISTRY\MACHINE\SYSTEM\*ControlSet*\Control\Lsa
    ObjectValueName:
    - LmCompatibilityLevel
    - NtlmMinClientSec
    - RestrictSendingNTLMTraffic
source: sigma
