type: x-detection-rule
id: x-detection-rule--aa160ea3-c808-4c13-b101-957548da4602
created: '2018-12-03T23:30:44.634Z'
modified: '2018-12-03T23:30:44.634Z'
title: NTLM Logon
status: experimental
description: Detects logons using NTLM, which could be caused by a legacy source
  or attackers
references:
- https://twitter.com/JohnLaTwC/status/1004895028995477505
- https://goo.gl/PsqrhT
author: Florian Roth
date: 2018/06/08
logsource:
  product: windows
  description: Reqiures events from Microsoft-Windows-NTLM/Operational
  service: ntlm
detection:
  condition: selection
  selection:
    CallingProcessName: '*'
    EventID: 8002
falsepositives:
- Legacy hosts
level: low
tags:
- attack.credential_access
- attack.t1208
source: sigma
