type: x-detection-rule
id: x-detection-rule--ad77c4c5-da60-4ebe-b033-ac492c083a95
created: '2018-12-03T23:30:44.619Z'
modified: '2018-12-03T23:30:44.619Z'
title: WCE wceaux.dll Access
status: experimental
description: Detects wceaux.dll access while WCE pass-the-hash remote command execution
  on source host
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
author: Thomas Patzke
logsource:
  product: windows
  service: security
detection:
  condition: selection
  selection:
    EventID:
    - 4656
    - 4658
    - 4660
    - 4663
    ObjectName: '*\wceaux.dll'
falsepositives:
- Penetration testing
level: critical
tags:
- attack.credential_access
- attack.t1003
- attack.s0005
source: sigma
