type: x-detection-rule
id: x-detection-rule--308b96b2-8f0e-4284-b3a4-51d0a11b401d
created: '2018-12-03T23:30:44.871Z'
modified: '2018-12-03T23:30:44.871Z'
title: Detection of PowerShell Execution via DLL
status: experimental
description: Detects PowerShell Strings applied to rundllas seen in PowerShdll.dll
references:
- https://github.com/p3nt4/PowerShdll/blob/master/README.md
author: Markus Neis
date: 2018/08/25
logsource:
  product: windows
  service: sysmon
detection:
  condition: (selection1 or selection2) and selection3
  selection1:
    EventID: 1
    Image:
    - '*\rundll32.exe'
  selection2:
    Description:
    - '*Windows-Hostprozess (Rundll32)*'
    EventID: 1
  selection3:
    CommandLine:
    - '*Default.GetString*'
    - '*FromBase64String*'
    EventID: 1
falsepositives:
- Unknown
level: high
tags:
- attack.execution
- attack.t1086
source: sigma
