type: x-detection-rule
id: x-detection-rule--5e72e301-de3f-4f75-89fe-adc216c33f83
created: '2018-12-03T23:30:44.710Z'
modified: '2018-12-03T23:30:44.710Z'
title: PowerShell ShellCode
status: experimental
description: Detects Base64 encoded Shellcode
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
author: David Ledbetter (shellcode), Florian Roth (rule)
date: 2018/11/17
logsource:
  product: windows
  description: Script block logging must be enabled
  service: powershell
detection:
  condition: selection and keyword1 and keyword2
  keyword1:
  - '*AAAAYInlM*'
  selection:
    EventID: 4104
  keyword2:
  - '*OiCAAAAYInlM*'
  - '*OiJAAAAYInlM*'
falsepositives:
- Unknown
level: critical
tags:
- attack.execution
source: sigma
