type: x-detection-rule
id: x-detection-rule--8acdfd17-9811-45db-9a4f-8cae885aba7a
created: '2018-12-03T23:30:44.708Z'
modified: '2018-12-03T23:30:44.708Z'
title: Suspicious PowerShell Invocations - Specific
status: experimental
description: Detects suspicious PowerShell invocation command parameters
author: Florian Roth (rule)
logsource:
  product: windows
  service: powershell
detection:
  condition: keywords
  keywords:
  - ' -nop -w hidden -c * [Convert]::FromBase64String'
  - ' -w hidden -noni -nop -c "iex(New-Object'
  - ' -w hidden -ep bypass -Enc'
  - powershell.exe reg add HKCU\software\microsoft\windows\currentversion\run
  - bypass -noprofile -windowstyle hidden (new-object system.net.webclient).download
  - iex(New-Object Net.WebClient).Download
falsepositives:
- Penetration tests
level: high
tags:
- attack.execution
- attack.t1086
source: sigma
