type: x-detection-rule
id: x-detection-rule--21656353-bed6-4e38-be91-f15752ccb565
created: '2018-12-03T23:30:44.759Z'
modified: '2018-12-03T23:30:44.759Z'
title: Net.exe Execution
status: experimental
description: Detects execution of Net.exe, whether suspicious or benign.
references:
- https://pentest.blog/windows-privilege-escalation-methods-for-pentesters/
author: Michael Haag, Mark Woan (improvements)
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine:
    - '* group*'
    - '* localgroup*'
    - '* user*'
    - '* view*'
    - '* share'
    - '* accounts*'
    - '* use*'
    EventID: 1
    Image:
    - '*\net.exe'
    - '*\net1.exe'
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- Will need to be tuned. If using Splunk, I recommend | stats count by Computer,CommandLine
  following the search for easy hunting by computer/CommandLine.
level: low
tags:
- attack.s0039
- attack.lateral_movement
- attack.discovery
source: sigma
