type: x-detection-rule
id: x-detection-rule--1d4980f2-c5af-4a63-8b21-7d05e535f2a4
created: '2018-12-03T23:30:44.577Z'
modified: '2018-12-03T23:30:44.577Z'
title: Reconnaissance Activity
status: experimental
description: Detects activity as "net user administrator /domain" and "net group
  domain admins /domain"
references:
- https://findingbad.blogspot.de/2017/01/hunting-what-does-it-look-like.html
author: Florian Roth (rule), Jack Croock (method)
logsource:
  product: windows
  description: The volume of Event ID 4661 is high on Domain Controllers and therefore
    "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not
    configured in the recommandations for server systems
  service: security
detection:
  condition: selection
  selection:
  - AccessMask: '0x2d'
    EventID: 4661
    ObjectName: S-1-5-21-*-500
    ObjectType: SAM_USER
  - AccessMask: '0x2d'
    EventID: 4661
    ObjectName: S-1-5-21-*-512
    ObjectType: SAM_GROUP
falsepositives:
- Administrator activity
- Penetration tests
level: high
tags:
- attack.discovery
- attack.t1087
- attack.t1069
- attack.s0039
source: sigma
