type: x-detection-rule
id: x-detection-rule--4e102667-dd70-4edc-b875-298454e4aba6
created: '2018-12-03T23:30:44.882Z'
modified: '2018-12-03T23:30:44.882Z'
title: Cmdkey Cached Credentials Recon
status: experimental
description: Detects usage of cmdkey to look for cached credentials
reference:
- https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
- https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
author: jmallette
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    CommandLine: '* /list *'
    EventID: 1
    Image: '*\cmdkey.exe'
fields:
- CommandLine
- ParentCommandLine
- User
falsepositives:
- Legitimate administrative tasks.
level: low
source: sigma
