type: x-detection-rule
id: x-detection-rule--9212dcf1-fac7-4f9f-a648-2050853e45af
created: '2018-12-03T23:30:44.413Z'
modified: '2018-12-03T23:30:44.413Z'
title: Download from Suspicious TLD
status: experimental
description: Detects download of certain file types from hosts in suspicious TLDs
references:
- https://www.symantec.com/connect/blogs/shady-tld-research-gdn-and-our-2016-wrap
- https://promos.mcafee.com/en-US/PDF/MTMW_Report.pdf
- https://www.spamhaus.org/statistics/tlds/
- https://krebsonsecurity.com/2018/06/bad-men-at-work-please-dont-click/
author: Florian Roth
date: 2018/06/13
logsource:
  category: proxy
detection:
  condition: selection
  selection:
    c-uri-extension:
    - exe
    - vbs
    - bat
    - rar
    - ps1
    - doc
    - docm
    - xls
    - xlsm
    - pptm
    - rtf
    - hta
    - dll
    - ws
    - wsf
    - sct
    - zip
    r-dns:
    - '*.country'
    - '*.stream'
    - '*.gdn'
    - '*.mom'
    - '*.xin'
    - '*.kim'
    - '*.men'
    - '*.loan'
    - '*.download'
    - '*.racing'
    - '*.online'
    - '*.science'
    - '*.ren'
    - '*.gb'
    - '*.win'
    - '*.top'
    - '*.review'
    - '*.vip'
    - '*.party'
    - '*.tech'
    - '*.tech'
    - '*.xyz'
    - '*.date'
    - '*.faith'
    - '*.zip'
    - '*.cricket'
    - '*.space'
    - '*.top'
    - '*.info'
    - '*.vn'
    - '*.cm'
    - '*.am'
    - '*.cc'
    - '*.asia'
    - '*.ws'
    - '*.tk'
    - '*.biz'
    - '*.su'
    - '*.st'
    - '*.ro'
    - '*.ge'
    - '*.ms'
    - '*.pk'
    - '*.nu'
    - '*.me'
    - '*.ph'
    - '*.to'
    - '*.tt'
    - '*.name'
    - '*.tv'
    - '*.kz'
    - '*.tc'
    - '*.mobi'
    - '*.study'
    - '*.click'
    - '*.link'
    - '*.trade'
    - '*.accountant'
    - '*.click'
    - '*.cf'
    - '*.gq'
    - '*.ml'
    - '*.ga'
fields:
- ClientIP
- URL
falsepositives:
- All kinds of software downloads
level: low
source: sigma
