type: x-detection-rule
id: x-detection-rule--e76f00f0-d2ba-40d9-a0fb-12513bb32f29
created: '2018-12-03T23:30:44.768Z'
modified: '2018-12-03T23:30:44.768Z'
title: Java Running with Remote Debugging
description: Detects a JAVA process running with remote debugging allowing more
  than just localhost to connect
author: Florian Roth
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection and not exclusion
  exclusion:
  - CommandLine: '*address=127.0.0.1*'
  - CommandLine: '*address=localhost*'
  selection:
    CommandLine: '*transport=dt_socket,address=*'
    EventID: 1
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- unknown
level: medium
source: sigma
