type: x-detection-rule
id: x-detection-rule--49002af3-9970-4097-8256-6f865ee0fe6b
created: '2018-12-03T23:30:44.728Z'
modified: '2018-12-03T23:30:44.728Z'
title: Microsoft Binary Suspicious Communication Endpoint
status: experimental
description: Detects an executable in the Windows folder accessing suspicious domains
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
author: Florian Roth
date: 2018/08/30
logsource:
  product: windows
  service: sysmon
detection:
  condition: selection
  selection:
    EventID: 3
    DestinationHostname:
    - '*dl.dropboxusercontent.com'
    - '*.pastebin.com'
    Image: C:\Windows\*
falsepositives:
- Unknown
level: high
source: sigma
