type: x-detection-rule
id: x-detection-rule--9fcde403-1e75-4d53-9265-670b62314a96
created: '2018-12-03T23:30:44.305Z'
modified: '2018-12-03T23:30:44.305Z'
title: Multiple Failed Logins with Different Accounts from Single Source System
description: Detects suspicious failed logins with different user accounts from
  a single source system
logsource:
  product: linux
  service: auth
detection:
  condition: selection | count(pam_user) by pam_rhost > 3
  selection:
    pam_message: authentication failure
    pam_rhost: '*'
    pam_user: '*'
  timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Workstations with frequently changing users
level: medium
source: sigma
