type: x-detection-rule
id: x-detection-rule--8a4056bb-a172-48e1-aec1-014b170f5afa
created: '2018-12-03T23:30:44.315Z'
modified: '2018-12-03T23:30:44.315Z'
title: Relevant ClamAV Message
description: Detects relevant ClamAV messages
references:
- https://github.com/ossec/ossec-hids/blob/master/etc/rules/clam_av_rules.xml
logsource:
  product: linux
  service: clamav
detection:
  condition: keywords
  keywords:
  - Trojan*FOUND
  - VirTool*FOUND
  - Webshell*FOUND
  - Rootkit*FOUND
  - Htran*FOUND
falsepositives:
- Unknown
level: high
source: sigma
