type: x-detection-rule
id: x-detection-rule--93529a64-cdb5-44e7-9c44-c78ff25fc137
created: '2018-12-03T23:30:44.372Z'
modified: '2018-12-03T23:30:44.372Z'
action: global
title: Sofacy Trojan Loader Activity
status: experimental
description: Detects Trojan loader acitivty as used by APT28
references:
- https://researchcenter.paloaltonetworks.com/2018/02/unit42-sofacy-attacks-multiple-government-entities/
- https://www.reverse.it/sample/e3399d4802f9e6d6d539e3ae57e7ea9a54610a7c4155a6541df8e94d67af086e?environmentId=100
- https://twitter.com/ClearskySec/status/960924755355369472
author: Florian Roth
date: 2018/03/01
detection:
  condition: selection
  selection:
    CommandLine:
    - rundll32.exe %APPDATA%\*.dat",*
    - rundll32.exe %APPDATA%\*.dll",#1
falsepositives:
- Unknown
level: critical
tags:
- attack.g0007
type: x-detection-rule
id: x-detection-rule--8555d2f8-d34b-47f9-9381-f7ff0c81187b
created: '2018-12-03T23:30:44.373Z'
modified: '2018-12-03T23:30:44.373Z'
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
type: x-detection-rule
id: x-detection-rule--851fc8e4-cb0f-4383-8a4a-91ccb5c6a350
created: '2018-12-03T23:30:44.374Z'
modified: '2018-12-03T23:30:44.374Z'
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation,
    Group Policy : Administrative Templates\System\Audit Process Creation'
  service: security
detection:
  selection:
    EventID: 4688
source: sigma
