type: x-detection-rule
id: x-detection-rule--3136d4e3-0f50-4861-bfc4-ad4eb7c0e61c
created: '2018-12-03T23:30:44.646Z'
modified: '2018-12-03T23:30:44.646Z'
action: global
title: Suspicious Process Creation
status: experimental
description: Detects suspicious process starts on Windows systems based on keywords
references:
- https://www.swordshield.com/2015/07/getting-hashes-from-ntds-dit-file/
- https://www.youtube.com/watch?v=H3t_kHQG1Js&feature=youtu.be&t=15m35s
- https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/
- https://twitter.com/subTee/status/872244674609676288
- https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/remote-tool-examples
- https://tyranidslair.blogspot.ca/2017/07/dg-on-windows-10-s-executing-arbitrary.html
- https://www.trustedsec.com/2017/07/new-tool-release-nps_payload/
- https://subt0x10.blogspot.ca/2017/04/bypassing-application-whitelisting.html
- https://gist.github.com/subTee/7937a8ef07409715f15b84781e180c46#file-rat-bat
- https://twitter.com/vector_sec/status/896049052642533376
author: Florian Roth
detection:
  condition: selection
  selection:
    CommandLine:
    - vssadmin.exe delete shadows*
    - vssadmin delete shadows*
    - vssadmin create shadow /for=C:*
    - copy \\?\GLOBALROOT\Device\*\windows\ntds\ntds.dit*
    - copy \\?\GLOBALROOT\Device\*\config\SAM*
    - reg SAVE HKLM\SYSTEM *
    - '* sekurlsa:*'
    - net localgroup adminstrators * /add
    - net group "Domain Admins" * /ADD /DOMAIN
    - certutil.exe *-urlcache* http*
    - certutil.exe *-urlcache* ftp*
    - netsh advfirewall firewall *\AppData\*
    - attrib +S +H +R *\AppData\*
    - schtasks* /create *\AppData\*
    - schtasks* /sc minute*
    - '*\Regasm.exe *\AppData\*'
    - '*\Regasm *\AppData\*'
    - '*\bitsadmin* /transfer*'
    - '*\certutil.exe * -decode *'
    - '*\certutil.exe * -decodehex *'
    - '*\certutil.exe -ping *'
    - icacls * /grant Everyone:F /T /C /Q
    - '* wmic shadowcopy delete *'
    - '* wbadmin.exe delete catalog -quiet*'
    - '*\wscript.exe *.jse'
    - '*\wscript.exe *.js'
    - '*\wscript.exe *.vba'
    - '*\wscript.exe *.vbe'
    - '*\cscript.exe *.jse'
    - '*\cscript.exe *.js'
    - '*\cscript.exe *.vba'
    - '*\cscript.exe *.vbe'
    - '*\fodhelper.exe'
    - '*waitfor*/s*'
    - '*waitfor*/si persist*'
    - '*remote*/s*'
    - '*remote*/c*'
    - '*remote*/q*'
    - '*AddInProcess*'
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
level: medium
type: x-detection-rule
id: x-detection-rule--79de35f9-9c0c-49db-8fc0-9d955ef70af4
created: '2018-12-03T23:30:44.647Z'
modified: '2018-12-03T23:30:44.647Z'
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
type: x-detection-rule
id: x-detection-rule--aafab10a-f55a-4f11-8faf-976d5ed37890
created: '2018-12-03T23:30:44.648Z'
modified: '2018-12-03T23:30:44.648Z'
logsource:
  product: windows
  description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation,
    Group Policy : Administrative Templates\System\Audit Process Creation'
  service: security
detection:
  selection:
    EventID: 4688
source: sigma
