type: x-detection-rule
id: x-detection-rule--e9b0492e-4c4a-43e8-93d2-1fa9d5e11a89
created: '2018-12-03T23:30:44.462Z'
modified: '2018-12-03T23:30:44.462Z'
title: Webshell Detection by Keyword
description: Detects webshells that use GET requests by keyword searches in URL
  strings
author: Florian Roth
logsource:
  category: webserver
detection:
  condition: keywords
  keywords:
  - =whoami
  - =net%20user
  - =cmd%20/c%20
fields:
- client_ip
- vhost
- url
- response
falsepositives:
- Web sites like wikis with articles on os commands and pages that include the os
  commands in the URLs
- User searches in search boxes of the respective website
level: high
source: sigma
