type: x-detection-rule
id: x-detection-rule--97c406b3-0bcf-4d59-b26d-3ba97098c1d0
created: '2018-12-03T23:30:44.423Z'
modified: '2018-12-03T23:30:44.423Z'
title: Windows WebDAV User Agent
status: experimental
description: Detects WebDav DownloadCradle
references:
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Florian Roth
date: 2018/04/06
logsource:
  category: proxy
detection:
  condition: selection
  selection:
    UserAgent: Microsoft-WebDAV-MiniRedir/*
    HttpMethod: GET
fields:
- ClientIP
- URL
- UserAgent
- HttpMethod
falsepositives:
- Administrative scripts that download files from the Internet
- Administrative scripts that retrieve certain website contents
- Legitimate WebDAV administration
level: high
source: sigma
